Revit 2024 API
ParameterTypeId.FabricationVendor Property
 "Vendor"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId FabricationVendor { get; }
Visual Basic
Public Shared ReadOnly Property FabricationVendor As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FabricationVendor {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace